#薛凡豪 20211120138 2023/3/21
s = ""
code ={"A":"._","B":"_...","C":"_._.","D":"_..","E":".","F":".._.","G":"__.","H":"....","I":"..","J":".___","K":"_._","L":"._..","M":"__","N":"_.","O":"___","P":".__.","Q":"__._","R":"._.","S":"...","T":"_","U":".._","V":"..._","W":".__","X":"_.._","Y":"_.__","Z":"__..","1":".____","2":"..___","3":"...__","4":"...._","5":".....","6":"_....","7":"__...","8":"___..","9":"____.","0":"_____"}
print("1:英文翻译为摩尔斯电文","2:摩尔斯电文翻译为英文")   #功能选择
choose = input("输入你的选择：")
if(choose=="1"):                          #选择分支1
    a = input("输入一段英文：")
    for i in range(len(a)):
        for j in code.keys():             #二次循环，第一次循环字符串长度，第二次循环键
            if(a[i]==j):
                s=s+code[j]+" "          #拼接到字符串s
    print("摩尔斯电文为："+s)
if(choose=="2"):
    a = list(input("输入一段莫尔斯电码：").split())        #进行一个分割列表处理，默认为空格为分隔符
    for i in range(len(a)):
        for j in code.values():
            if(a[i]==j):
                for k in code.keys():                     #三次循环，第一次字符串长度，第二次循环键值，第三次寻找键
                    if(code[k]==a[i]):
                        s=s+k+" "
    print("英文为："+s)                        #拼接输出